; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	satellite5 - satellite
	instrument10 - instrument
	thermograph1 - mode
	image0 - mode
	thermograph4 - mode
	thermograph2 - mode
	image3 - mode
	GroundStation3 - direction
	Star6 - direction
	Star1 - direction
	Star5 - direction
	Star0 - direction
	Star2 - direction
	Star4 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Star10 - direction
	Star11 - direction
	Star12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 thermograph4)
	(supports instrument0 thermograph1)
	(supports instrument0 image3)
	(calibration_target instrument0 Star5)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
	(supports instrument1 image0)
	(supports instrument1 image3)
	(calibration_target instrument1 Star0)
	(supports instrument2 thermograph2)
	(supports instrument2 thermograph4)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 Star1)
	(supports instrument3 image3)
	(supports instrument3 image0)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 Star6)
	(calibration_target instrument3 Star5)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star9)
	(supports instrument4 thermograph4)
	(supports instrument4 thermograph1)
	(supports instrument4 image3)
	(calibration_target instrument4 Star1)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star1)
	(supports instrument5 image0)
	(supports instrument5 thermograph1)
	(supports instrument5 thermograph2)
	(calibration_target instrument5 Star5)
	(supports instrument6 thermograph4)
	(calibration_target instrument6 Star4)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star4)
	(supports instrument7 thermograph2)
	(supports instrument7 thermograph1)
	(calibration_target instrument7 Star0)
	(supports instrument8 thermograph4)
	(supports instrument8 thermograph2)
	(calibration_target instrument8 Star0)
	(supports instrument9 image0)
	(calibration_target instrument9 Star2)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon8)
	(supports instrument10 thermograph1)
	(supports instrument10 image0)
	(calibration_target instrument10 Star4)
	(on_board instrument10 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star11)
)
(:goal (and
	(pointing satellite0 Star11)
	(pointing satellite1 Star11)
	(pointing satellite4 Star12)
	(have_image Planet7 thermograph4)
	(have_image Phenomenon8 image0)
	(have_image Star9 image3)
	(have_image Star10 image3)
	(have_image Star11 image3)
	(have_image Star12 thermograph1)
	(have_image Phenomenon13 image3)
))

)

; plan
1. (turn_to satellite4 star12 phenomenon8)
   deleted: (pointing satellite4 phenomenon8)
   added: (pointing satellite4 star12)
   goals met: 1 of 10
2. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 1 of 10
3. (calibrate satellite2 instrument4 star1)
   added: (calibrated instrument4)
   goals met: 1 of 10
4. (turn_to satellite2 planet7 star1)
   deleted: (pointing satellite2 star1)
   added: (pointing satellite2 planet7)
   goals met: 1 of 10
5. (take_image satellite2 planet7 instrument4 thermograph4)
   added: (have_image planet7 thermograph4)
   goals met: 2 of 10
6. (turn_to satellite2 phenomenon13 planet7)
   deleted: (pointing satellite2 planet7)
   added: (pointing satellite2 phenomenon13)
   goals met: 2 of 10
7. (turn_to satellite1 star0 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 star0)
   goals met: 2 of 10
8. (turn_to satellite0 star11 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star11)
   goals met: 3 of 10
9. (take_image satellite2 phenomenon13 instrument4 image3)
   added: (have_image phenomenon13 image3)
   goals met: 4 of 10
10. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 4 of 10
11. (calibrate satellite1 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 4 of 10
12. (turn_to satellite1 phenomenon8 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 phenomenon8)
   goals met: 4 of 10
13. (take_image satellite1 phenomenon8 instrument1 image0)
   added: (have_image phenomenon8 image0)
   goals met: 5 of 10
14. (turn_to satellite1 star10 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 star10)
   goals met: 5 of 10
15. (take_image satellite1 star10 instrument1 image3)
   added: (have_image star10 image3)
   goals met: 6 of 10
16. (turn_to satellite1 star11 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star11)
   goals met: 7 of 10
17. (take_image satellite1 star11 instrument1 image3)
   added: (have_image star11 image3)
   goals met: 8 of 10
18. (turn_to satellite2 star12 phenomenon13)
   deleted: (pointing satellite2 phenomenon13)
   added: (pointing satellite2 star12)
   goals met: 8 of 10
19. (take_image satellite2 star12 instrument4 thermograph1)
   added: (have_image star12 thermograph1)
   goals met: 9 of 10
20. (turn_to satellite2 star9 star12)
   deleted: (pointing satellite2 star12)
   added: (pointing satellite2 star9)
   goals met: 9 of 10
21. (take_image satellite2 star9 instrument4 image3)
   added: (have_image star9 image3)
   goals met: 10 of 10
